tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "mongodb/brew"

# User CLI tools
brew "zsh-autosuggestions"
brew "fzf"
brew "gh"
brew "git-lfs"

# Neovim and dependencies
brew "neovim"
brew "tree-sitter"
brew "tree-sitter-cli"

# LSP servers
brew "lua-language-server"
brew "bash-language-server"
brew "pyright"
brew "ruff"
brew "gopls"
brew "rust-analyzer"

# macOS-only apps
cask "iterm2"
cask "visual-studio-code"
